import "../css/Introduction.css";

export default function Introduction(){
    return (
        <div id="introduction">
            <span>자기소개</span>
            <div>
                <ul>
                    <li>더 나은 비즈니스에 대해 고민하고, 서비스에 애정을 가진
                    개발자이기 전에 서비스를 만드는 사람으로서, 고객에게 더 나은 비즈니스는 무엇인지 고민하며 개발합니다. 서비스에 애정을 가지면 더 좋은 결과물이 나온다고 믿고, 애정을 담아 만듭니다.</li>
                    <li>사람을 좋아하고, 커뮤니케이션을 좋아하는
                    혼자보다 같이 하는 활동을 좋아해서 개발할 때 서로 의견을 조율하고, 더 좋은 방법을 고민하는 과정을 즐깁니다. 원활하게 커뮤니케이션할 수 있는 방법 중 하나는 문서화라고 생각해서 팀 프로젝트를 진행할 때 문서화를 중요시했습니다.</li>
                    <li>내가 보기에도, 동료가 보기에도 좋은 코드
                    동료가 봤을 때도 이해하기 쉽고, 유지보수하기 쉬운 코드를 작성하기 위해 노력합니다.</li>
                    <li>끊임없이 의심하고 질문하는
                    더 좋은 방법은 없는지, 왜 이렇게 짰는지 스스로 의심하고 질문하며 개발합니다.</li>
                </ul>
            </div>
        </div>
    )
}